# Pandas 기술통계

## 학습목표
- 데이터분석을 위한 기술통계량 탐색하기
- 실데이터를 활용하여 기술통계량 확인하기

In [1]:
import pandas as pd
import numpy as np

In [5]:
hr_info = pd.read_csv("data/hr-info.csv",encoding="euc-kr")
hr_info

,EID,ENAME,GENDER,ORG_CD,POS_CD,AGE,SERVICE_YEAR,EDU_LEVEL,PERFORMANCE_SCORE,SALARY,LAST_PROMO_DT,TRAINING_HOURS,SKILLS,ACTIVE_STATE,HIRE_DATE,RETIRE_DATE,RETIRE_REASON,REHIRE_YN,NATION,ROUNDING_DEDUCTION
0,E00206,시이오,M,NaN,P001,49,25,박사 학위,4.50,10200,2024-03-01,240,"Marketing, Salesforce",Y,1999-03-01,NaN,NaN,NaN,KOREA,Y
1,E00181,나사장,F,NaN,P002,49,24,박사 학위,4.60,9500,2024-03-01,236,"Project Management, Marketing",Y,2000-03-01,NaN,NaN,NaN,KOREA,Y
2,E00164,난부사장,M,NaN,P003,48,22,박사 학위,4.60,9100,2024-03-01,240,"Salesforce, Data Analysis, Java",Y,2002-03-01,NaN,NaN,NaN,KOREA,Y
3,E00190,판라다,F,ORG007,P004,47,18,박사 학위,3.51,8500,2024-03-01,96,"Java, Data Analysis, Salesforce",Y,2006-03-01,NaN,NaN,NaN,KOREA,Y
4,E00209,누훈봉,M,ORG023,P004,47,19,박사 학위,3.38,8600,2023-03-01,66,"Java, Salesforce",Y,2005-03-01,NaN,NaN,NaN,KOREA,Y
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
195,E00322,부탐회,F,ORG014,P009,23,0,학사 학위,0.00,4500,NaN,4,Java,Y,2024-09-01,NaN,NaN,NaN,KOREA,N
196,E00389,초두반,F,ORG012,P009,23,0,학사 학위,0.00,4500,NaN,4,"Salesforce, Java",Y,2024-09-01,NaN,NaN,NaN,KOREA,N
197,E00438,권개득,M,ORG024,P009,23,0,학사 학위,0.00,4500,NaN,4,Python,Y,2024-09-01,NaN,NaN,NaN,KOREA,N
198,E00304,탐출조,M,ORG009,P009,24,0,학사 학위,0.00,4500,NaN,4,Salesforce,Y,2024-09-01,NaN,NaN,NaN,KOREA,N
199,E00428,을충나,F,ORG003,P009,24,0,학사 학위,0.00,4500,NaN,4,"Data Analysis, Python, Marketing",Y,2024-09-01,NaN,NaN,NaN,KOREA,N

In [6]:
# 정보확인
hr_info.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 20 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   EID                 200 non-null    object
 1   ENAME               200 non-null    object
 2   GENDER              200 non-null    object
 3   ORG_CD              197 non-null    object
 4   POS_CD              200 non-null    object
 5   AGE                 200 non-null    int64
 6   SERVICE_YEAR        200 non-null    int64
 7   EDU_LEVEL           200 non-null    object
 8   PERFORMANCE_SCORE   200 non-null    float64
 9   SALARY              200 non-null    int64
 10  LAST_PROMO_DT       182 non-null    object
 11  TRAINING_HOURS      200 non-null    int64
 12  SKILLS              200 non-null    object
 13  ACTIVE_STATE        200 non-null    object
 14  HIRE_DATE           200 non-null    object
 15  RETIRE_DATE         49 non-null     object
 16  RETIRE_REASON       49 non-null     object
 17  REHIRE_YN           49 non-null     object
 18  NATION              200 non-null    object
 19  ROUNDING_DEDUCTION  200 non-null    object
dtypes: float64(1), int64(4), object(15)
memory usage: 31.4+ KB

- 기술통계량 확인 > 기본 수치데이터 확인할 수 있다!

In [17]:
hr_info.describe() # 수치데이터들만 알아서 계산해서 출력

,AGE,SERVICE_YEAR,PERFORMANCE_SCORE,SALARY,TRAINING_HOURS
count,200.000000,200.000000,200.000000,200.000000,200.000000
mean,31.930000,4.660000,1.919900,5987.000000,34.745000
std,7.111114,6.183492,1.748062,1182.676889,40.470971
min,22.000000,0.000000,0.000000,4500.000000,0.000000
25%,27.000000,0.000000,0.000000,5000.000000,4.000000
50%,30.000000,1.000000,1.795000,5600.000000,21.000000
75%,37.000000,8.000000,3.412500,6825.000000,56.750000
max,49.000000,25.000000,4.960000,10200.000000,240.000000

- count : 결측치를 제외한 데이터의 총 개수
- mean : 평균
- std : 표준편차 (데이터의 분포)> 0에 가까울수록 평균에 밀집되어 있음. 데이터의 흩어진 정도  
- min : 최솟값, max : 최댓값
- 25%,50%,75% : 사분위수 > 데이터의 분포 (전체 데이터의 1/4지점, 2/4지점, 3/4지점)
- 대푯값 : 평균 /50%(중앙값) > 평균과 중앙값의 차이로 데이터의 형태를 확인 (이상치 확인) / 최빈값(string 형태의 데이터)

- 문자데이터 확인

In [18]:
hr_info.describe(include = 'object')

,EID,ENAME,GENDER,ORG_CD,POS_CD,EDU_LEVEL,LAST_PROMO_DT,SKILLS,ACTIVE_STATE,HIRE_DATE,RETIRE_DATE,RETIRE_REASON,REHIRE_YN,NATION,ROUNDING_DEDUCTION
count,200,200,200,197,200,200,182,200,200,200,49,49,49,200,200
unique,200,200,2,30,9,5,4,91,2,16,8,6,2,6,2
top,E00206,시이오,M,ORG021,P008,학사 학위,2024-03-01,Salesforce,Y,2024-03-01,2024-03-01,이직,N,KOREA,Y
freq,1,1,117,12,55,159,111,24,151,64,19,28,45,102,150

- count : 데이터 개수
- unique : 중복되지 않은 값 (카테고리 수)
- top : 최빈값에 해당하는 값
- freq : 최빈값

#### 통계값 개별 확인
    - 총합, 평균, 개수 , 중복값

- 총합 : sum()

In [19]:
#연간 인건비
hr_info['SALARY'].sum()

np.int64(1197400)

- 평균 : mean()

In [20]:
#평균 연봉
hr_info['SALARY'].mean()

np.float64(5987.0)

- 데이터 개수 확인
  - count() : 결측치를 제외한 개수 
  - value_counts() : 존재하는 카테고리별로 개수를 세줌 (unique한 값들을 기준으로 개수를 세주는 함수)

In [22]:
hr_info['RETIRE_DATE'].count() # 결측치를 제외한 개수

np.int64(49)

In [25]:
hr_info['GENDER'].value_counts() # 각 항목별로 개수를 counting해줌

GENDER
M    117
F     83
Name: count, dtype: int64

In [31]:
# 전체 직원중 남자 비율
male_count = hr_info['GENDER'].value_counts()['M'] # indexing 가능!
total_count = hr_info['GENDER'].count()
male_count / total_count

np.float64(0.585)

- unique() : 중복되지 않은 유일한 값들을 추출할 때 활용 > 카테고리

In [32]:
# 직원들 국적 확인
hr_info['NATION'].unique()

array(['KOREA', 'Japan', 'USA', 'India', 'China', 'UK'], dtype=object)

In [33]:
# 국적별 직원 수 
hr_info['NATION'].value_counts()

NATION
KOREA    102
USA       22
India     22
Japan     21
UK        18
China     15
Name: count, dtype: int64

- min(),max()

In [36]:
# 최대, 최소 근속연수
hr_info['SERVICE_YEAR'].min() ,hr_info['SERVICE_YEAR'].max()

(0, 25)

- median()

In [39]:
# 나이의 중앙값 
hr_info['AGE'].median()

30.0

> 데이터를 활용해서 분석할 때, 근거를 제시하기 위해 통계값들을 활용함

#### 실습
- 교육 수준에 따른 평균 연봉

- 교육 수준 카테고리 확인 > unique()
- 불리언 인덱싱을 통해 한개의 카테고리의 평균 연봉 구하기
- 반복문을 활용하여 각각 모든 하력에 대한 평균 연봉 구하기

In [57]:
edu_uni = hr_info['EDU_LEVEL'].unique()
edu_uni

array(['박사 학위', '학사 학위', '석사 학위', '고등학교 졸업', '전문대 학위'], dtype=object)

- for문에서 list를 받아서 하는 방법 > 사실 groupby 사용하면 됨

In [58]:
for level in edu_uni:
    print(f"{level}: {hr_info[hr_info['EDU_LEVEL'] == level]['SALARY'].mean().round(2)}")

박사 학위: 8166.67
학사 학위: 5727.04
석사 학위: 6900.0
고등학교 졸업: 6140.0
전문대 학위: 5050.0

- 데이터 그룹화를 이용한 통계분석
  - groupby() : 카테고리별로 그룹을 만들어 연산을 수행
  - 사용법 : 데이터.groupby(기준 컬럼명).연산함수
  - 카테고리로 설정할 데이터가 들어있는 컬럼을 기준컬럼이라고 함

In [64]:
# 기준이 "EDU_LEVEL"
hr_info[['EDU_LEVEL','SALARY']].groupby('EDU_LEVEL').mean()

                SALARY
EDU_LEVEL
고등학교 졸업    6140.000000
박사 학위      8166.666667
석사 학위      6900.000000
전문대 학위     5050.000000
학사 학위      5727.044025

In [68]:
# 교육수준과 성별에 따른 평균연봉
hr_info[['EDU_LEVEL','GENDER','SALARY']].groupby(['EDU_LEVEL','GENDER']).mean() # 기준이 2개 이상이면 리스트 형태로 묶어주어야함

                       SALARY
EDU_LEVEL GENDER
고등학교 졸업   F       6200.000000
          M       6100.000000
박사 학위     F       8425.000000
          M       8037.500000
석사 학위     F       7233.333333
          M       6525.000000
전문대 학위    F       5600.000000
          M       4500.000000
학사 학위     F       5643.076923
          M       5785.106383

In [70]:
# 성별에 따른평균연봉
hr_info[['GENDER','SALARY']].groupby(['GENDER']).mean()

             SALARY
GENDER
F       5975.903614
M       5994.871795

- 가설 : 학사학위인 남자가 많을 것이다 > 가설검정

- 그룹화 후에 여러가지 통계값 확인
  - 데이터.groupby(기준).agg(['원하는 통계량'])

In [74]:
# 성별에 따른 연봉의 다양한 통계량 구하기 (평균, 최댓값, 최솟값, 중앙값)
hr_info[['GENDER','SALARY']].groupby(['GENDER']).agg(['mean','max','min','median'])

             SALARY
               mean    max   min  median
GENDER
F       5975.903614   9500  4500  5600.0
M       5994.871795  10200  4500  5600.0

In [75]:
hr_info[['GENDER','SALARY']].groupby(['GENDER']).describe().T

GENDER                  F             M
SALARY count    83.000000    117.000000
       mean   5975.903614   5994.871795
       std    1196.192166   1178.093591
       min    4500.000000   4500.000000
       25%    5000.000000   5000.000000
       50%    5600.000000   5600.000000
       75%    6850.000000   6800.000000
       max    9500.000000  10200.000000

#### 상관관계
- 상관분석 : 확률론과 통계학에서 두 변수(컬럼들을 의미)간에 어떤 선형적 관계를 갖고 있는 지를 분석하는 방법
- 상관 관계 : 두 변수는 서로 독립적인 관계
   - 양의 상관관계 : 상관계수가 1에 가까움
   - 음의 상관관계 : 상관계수가 -1에 가까움
   - 상관관계 없음 : 상관계수가 0 에 가까움

- 상관계수 확인 : data.corr()
  - 각 변수간의 선형적 관계를 확인

In [77]:
# 성과평가 점
hr_info[['PERFORMANCE_SCORE','SALARY']].corr()

                   PERFORMANCE_SCORE    SALARY
PERFORMANCE_SCORE           1.000000  0.609152
SALARY                      0.609152  1.000000

- 성과평가와 연봉은 양의 상관관계를 가짐 (0.609152)

In [79]:
hr_info.corr(numeric_only=True) # numeric_only = True 조건을 줘서 수치형값들만 확인할 수 잇도록

,AGE,SERVICE_YEAR,PERFORMANCE_SCORE,SALARY,TRAINING_HOURS
AGE,1.000000,0.932563,0.582203,0.961699,0.575867
SERVICE_YEAR,0.932563,1.000000,0.492801,0.970875,0.559911
PERFORMANCE_SCORE,0.582203,0.492801,1.000000,0.609152,0.551200
SALARY,0.961699,0.970875,0.609152,1.000000,0.628931
TRAINING_HOURS,0.575867,0.559911,0.551200,0.628931,1.000000

- 절대값이 1에 가까울수록 상관관계가 높다
- 근속년수가 높을수록 연봉이 높다

In [83]:
# 데이터정렬
corr_res = hr_info.corr(numeric_only=True)
corr_res['SALARY'].sort_values() # 기본 : 오름차순 정렬

PERFORMANCE_SCORE    0.609152
TRAINING_HOURS       0.628931
AGE                  0.961699
SERVICE_YEAR         0.970875
SALARY               1.000000
Name: SALARY, dtype: float64

In [84]:
corr_res['SALARY'].sort_values(ascending = False) # 내림차순 정렬하려면?

SALARY               1.000000
SERVICE_YEAR         0.970875
AGE                  0.961699
TRAINING_HOURS       0.628931
PERFORMANCE_SCORE    0.609152
Name: SALARY, dtype: float64